Revit 2027 API
FluidType.AddTemperature Method
 Adds a fluid temperature to the set.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddTemperature(
	FluidTemperature fluidTemperature
)
Public Sub AddTemperature (
	fluidTemperature As FluidTemperature
)
public:
void AddTemperature(
	FluidTemperature^ fluidTemperature
)
member AddTemperature :
        fluidTemperature : FluidTemperature -> unit
Parameters
fluidTemperature FluidTemperature
 The fluid temperature being inserted.
Exceptions
Exception | Condition
ArgumentException |  Thrown if the temperature that will be added already exists in the fluid type.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace